Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་སློབ་པ་དང་། ནང་སྟོང་པ་ཉིད་ལ་སློབ་སློབ་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སློབ་སློབ་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སློབ་སློབ་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ལ་སློབ་སློབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་སློབ་སློབ་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སློབ་སློབ་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཀྱིས་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པར་གྱུར་ཏོ། །ཕ་རོལ་དུ་ཕྱིན་ཏོ།
en: Training in this perfection of wisdom; training in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity; training in the emptiness of internal phenomena; training in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; training in this applications of mindfulness; training in the [other causal attributes], up to and including the noble eightfold path; training in [the fruitional attributes], up to and including the distinct qualities of the buddhas; and training in [all the fruits and realizations], up to and including all-aspect omniscience, the lord buddhas, the pratyekabuddhas, the arhats, those who will no longer be reborn, those who are destined for only one more rebirth, and those who have entered the stream to nirvāṇa have also gone beyond, are going beyond, and will go beyond. “

source: །ཕ་རོལ་དུ་ཕྱིན་པར་འགྱུར་རོ་ཞེས་བྱ་བར་ཤེས་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་བཞུགས་ཀྱང་རུང་། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་རུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བརྟེན་པར་བྱའོ།
en: Kauśika, so it is that those noble sons or noble daughters should rely on this very perfection of wisdom, whether the tathāgatas are present or whether the tathāgatas have passed into final nirvāṇa.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་རྟེན་ཡིན་ཏེ།
en: If you ask why, Kauśika, this perfection of wisdom is itself the support of all śrāvakas, pratyekabuddhas, and bodhisattva great beings.

source: ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་གྱི་སྐྱེ་དགུའི་བར་གྱི་རྟེན་ཡིན་ནོ། །དེ་དག་གིས་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: It is the support of all living phenomena, up to and including the gods, humans, and asuras.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་བརྟེན་པར་བྱ་སྟེ།
en: All these should similarly rely on the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity, and on [all the other attributes, fruits, and realizations], up to and including all-aspect omniscience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འདི་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་རྟེན་ཡིན་ཏེ།
en: If you ask why, Kauśika, this all-aspect omniscience [and so forth] is the support of all śrāvakas, pratyekabuddhas, and bodhisattva great beings.

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་གྱི་སྐྱེ་དགུའི་བར་གྱི་རྟེན་ཡིན་ནོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: It is the support of all living beings, up to and including the gods, humans, and asuras. {

source: བམ་པོ་སུམ་ཅུ་གཉིས་པ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ།
en: Ki.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། མཆོད་པའི་ཕྱིར་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པ་བྱས་ཏེ། དེ་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཕྱིར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལམ།
en: II-III: 63} “Kauśika, if any noble son or noble daughter were to make a stūpa of the seven precious materials, about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship it for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, religious garments, robes, parasols, victory banners, ribbons, and many divine musical sounds, do you think, Kauśika, that the merit of that noble son or noble daughter would for that reason increase manifold?” “

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ངོ་།
en: It would, Blessed Lord!

source: །བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་པ་དང་།
en: It would, Sugata!”

source: འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་།
en: Śakra replied.

source: གཞན་ལ་ཡང་རྒྱ་ཆེར་སྟོན་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མི་འབྲལ་ལ། གོང་དུ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་མཆོད་རྟེན་གཅིག་ལྟ་ཞོག་གི།
en: The Blessed One then said, “Kauśika, if any noble son or noble daughter were to commit this perfection of wisdom to writing and then take up, uphold, recite, master, and focus their attention correctly on it, teaching it extensively to others, without being separated from the mind set on all-aspect omniscience, and in addition were to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former. “

source: །ཀཽ་ཤི་ཀ་གལ་ཏེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་ཕྱིར་འཛམ་བུའི་གླིང་འདི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པས་ཡོངས་སུ་བཀང་སྟེ། དེ་དག་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཕྱིར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་མང་བུ་འཕེལ་ལམ།
en: Kauśika, leaving aside that one stūpa, if any noble son or noble daughter were to fill this Jambudvīpa with stūpas made of the seven precious materials, about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, religious garments, robes, parasols, victory banners, ribbons, and many divine musical sounds, do you think, Kauśika, that the merit of that noble son or noble daughter would for that reason increase manifold?” “

source: འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་།
en: Śakra replied.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མི་འབྲལ་ལ། གོང་དུ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: The Blessed One then said, “Kauśika, if any noble son or noble daughter were to commit this perfection of wisdom to writing and then take up, uphold, recite, master, and focus their attention correctly on it, without being separated from the mind set on all-aspect omniscience, and in addition were to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former. {

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Ki.

source: །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་འདི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱིས་ཡོངས་སུ་བཀང་བ་ལྟ་ཞོག་གི། །ཀཽ་ཤི་ཀ་གལ་ཏེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། མཆོད་པའི་ཕྱིར་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པས་ཡོངས་སུ་བཀང་སྟེ། དེ་དག་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཕྱིར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལམ།
en: II-III: 64} “Kauśika, leaving aside that filling of this Jambudvīpa with stūpas of the tathāgata, if, Kauśika, any noble son or noble daughter were to fill this world system with its four continents with stūpas made of the seven precious materials, about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, religious robes, garments, parasols, victory banners, ribbons, and many divine musical sounds, do you think, Kauśika, that the merit of that noble son or noble daughter would for that reason increase manifold?” “

source: །བདེ་བར་གཤེགས་པ་མང་ངོ་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རི
en: It would, Sugata!”

source: གས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྱས་ཏེ། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བྲིས་ཤིང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Śakra replied.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: The Blessed One then said, “Kauśika, if any noble son or noble daughter were to make this perfection of wisdom into a book and then take up, uphold, recite, master, and focus their attention correctly on it, committing it to writing, and in addition were to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former. “

source: །ཀཽ་ཤི་ཀ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱིས་ཡོངས་སུ་བཀང་བ་ལྟ་ཞོག་གི། །ཀཽ་ཤི་ཀ་གལ་ཏེ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་ཕྱིར། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུ་འདི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པས་ཡོངས་སུ་བཀང་སྟེ། དེ་དག་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཕྱིར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside that filling of the world system with its four continents with stūpas of the tathāgata, if, Kauśika, any noble son or noble daughter were to fill this confined chiliocosm with stūpas made of the seven precious materials, about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and many divine musical sounds, do you think, Kauśika, that the merit of that noble son or noble daughter would for that reason increase manifold?” “

source: །བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: It would, Sugata!”

source: ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ།
en: Śakra replied.

source: རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྱས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བྲིས་ཤིང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: The Blessed One then said, “Kauśika, if any noble son or noble daughter were to make this perfection of wisdom into a book and then take up, uphold, recite, master, and focus their attention correctly on it, committing it to writing, and were to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former. {

source: །ཀཽ་ཤི་ཀ་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱིས་ཡོངས་སུ་བཀང་བ་ལྟ་ཞོག་གི། །ཀཽ་ཤི་ཀ་གལ་ཏེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་ཕྱིར། འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོ་སྟོང་གཉིས་པ་འདི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པས་ཡོངས་སུ་བཀང་སྟེ། དེ་དག་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། དེའི་ཕྱིར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལམ།
en: II-III: 65} “Kauśika, leaving aside that filling of the confined chiliocosm with stūpas of the tathāgata, if, Kauśika, any noble son or noble daughter were to fill this medium dichiliocosm with stūpas made of the seven precious materials, about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and many musical sounds, do you think, Kauśika, that the merit of that noble son or noble daughter would for that reason increase manifold?” “

source: བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: It would, Sugata!”

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Śakra replied.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོ་སྟོང་གཉིས་པ་འདི། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱིས་ཡོངས་སུ་བཀང་བ་ལྟ་ཞོག་གི། །ཀཽ་ཤི་ཀ་གལ་ཏེ་རིགས་ཀྱི་བུའམ།
en: The Blessed One then said, “Kauśika, if any noble son or noble daughter were to commit this perfection of wisdom to writing and then take up, uphold, recite, master, and focus their attention correctly on it, and were to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former. “

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་ཕྱིར། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པས་ཡོངས་སུ་བཀང་སྟེ། དེ་དག་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside that filling of the medium dichiliocosm with stūpas of the tathāgata, if, Kauśika, any noble son or noble daughter were to fill this great trichiliocosm with stūpas made of the seven precious materials, about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and many divine musical sounds, do you think, Kauśika, that the merit of that noble son or noble daughter would increase manifold?” “

source: གས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Śakra replied.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱིས་ཡོངས་སུ་བཀང་བ་ལྟ་ཞོག་གི། །ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ལས་སེམས་ཅན་རེ་རེས།
en: The Blessed One then said, “Kauśika, if any noble son or noble daughter were to commit this perfection of wisdom to writing and then take up, uphold, recite, master, and focus their attention correctly on it, and were to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former. “

source: དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་ཕྱིར། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པ་ཤ་སྟག་བྱས་ཏེ། དེ་དག་ལ་ནམ་འཚོའི་བར་དུ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་པ་བས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བྱས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པ་དང་།
en: Kauśika, leaving aside that filling of the great trichiliocosm with stūpas of the tathāgata, if, Kauśika, each being among all the beings in the great trichiliocosm were to build stūpas made of the seven precious materials, all of them about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and they were then to serve, respect, honor, and worship these stūpas for the duration of their lives with divine flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and many divine musical sounds— {Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མ་བྲལ་བར་བྱས་ཏེ། དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། དེ་ཉིད་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: II-III: 66} and if, on the other hand, any noble son or noble daughter were to commit this perfection of wisdom to writing and then take up, uphold, recite, master, and focus their attention correctly on it, without being separated from the mind set on all-aspect omniscience, and were then to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds—the merit of that one would increase manifold to a greater extent than the former.” “

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལགས་སོ།
en: That is so, Blessed Lord!

source: །བདེ་བར་གཤེགས་པ་དེ་དེ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རིམ་གྲོར་བགྱིས་པ་དང་། བཀུར་སྟིར་བགྱིས་པ་དང་།
en: That is so, Sugata!”

source: བསྟི་སྟང་དུ་བགྱིས་པ་དང་། མཆོད་པར་བགྱིས་པས་ནི།
en: Śakra exclaimed. “

source: འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་རིམ་གྲོར་བགྱིས་པ་དང་། བཀུར་སྟིར་བགྱིས་པ་དང་། བསྟི་སྟང་དུ་བགྱིས་པ་དང་། མཆོད་པར་བགྱིས་པར་འགྱུར་རོ། །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་མཆིས་པ་དེ་དག་ལས།
en: Blessed Lord, those who serve, respect, honor, and worship the perfection of wisdom will serve, respect, honor, and worship the tathāgatas, arhats, completely awakened buddhas of the past, future, and present. “

source: སེམས་ཅན་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་སླད་དུ། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བགྱིས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པ་ཤ་སྟག་བགྱིས་ཏེ། དེ་དག་ལ་བསྐལ་བའམ། བསྐལ་པའི་ལྷག་མར་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིས། བཀུར་སྟིར་བགྱིས། བསྟི་སྟང་དུ་བགྱིས། མཆོད་པར་བགྱིས་པ་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་མཆིས་པ་དེ་དག་ལས། སེམས་ཅན་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་མཆོད་པའི་སླད་དུ། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བགྱིས་པའི་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་ཙམ་ལ། རྒྱར་དཔག་ཚད་ཕྱེད་པ་ཤ་སྟག་བགྱིས་ཏེ། དེ་དག་ལ་བསྐལ་པའམ། བསྐལ་པའི་ལྷག་མར་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་།
en: Even if each being among all the beings that there are in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, were also to build stūpas made of the seven precious materials, all of them about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for an eon or for longer than an eon with divine flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various divine musical sounds—and even if each being among all the beings that there are in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, were also to build stūpas made of the seven precious materials, all of them about one yojana in height and half a yojana in width, in order to worship a tathāgata who had passed into final nirvāṇa, and were then to serve, respect, honor, and worship these stūpas for an eon or for longer than an eon with divine flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various divine musical sounds—do you think, Blessed Lord, that the merit of those noble sons or noble daughters would for that reason increase manifold?” “

source: ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིས། བཀུར་སྟིར་བགྱིས། བསྟི་སྟང་དུ་བགྱིས། མཆོད་པར་བགྱིས་ན། བཅོམ་ལྡན་འདས་དེ་ལ་ཇི་ལྟར་དགོངས། དེའི་སླད་དུ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་མང་དུ་འཕེལ་བ་ལགས་སམ།
en: They would, Kauśika!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་མང་ངོ་། །བརྒྱ་བྱིན་གྱིས་གསོལ་པ།
en: replied the Blessed One.
